//Выражение — строка, которая может быть вычеслина интерпритатором языка. (*) - оператор
c = 2*3


//Инструкция — синтаксические конструкции и команды, которые выполняют действие (законченное выражение)
let c = 2*3;


//Идентификатор – последовательность символов для определения переменных, функций, свойств объекта
age, myName, number_one, $cash


//Условные инструкции позволяют выполнить некоторые строки кода при выполнении определенных условий
if, switch


//Инструкции циклов позволяют многократно выполнить определенный код, если выполняетс определенное условие
while, do while, for()


//Функция – блок програмного кода, который определяется 1 раз и может вызываться многократно
function func() {
}

//Параметр - локальные переменные в коде функции, через которые передается значение
function func(param1, param2) {
}


//Объект – неупорядочный набор свойств, каждое из которых имеет значение
let 


//Метод объекта — свойство объекта, к которым привязаны определенные функции



//Массив – упорядочный набор значений. Значением называется элемент массива, который характеризуется числовой позицией
let arr2 = [1,23,,4,5,6,7,8,9,10];
let arr5 = Array(1,23,,4,5);